tap "gcenx/wine"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "koekeishiya/formulae"
tap "sidneys/homebrew"
tap "smartthingscommunity/smartthings"
tap "teamookla/speedtest"
# Run your GitHub Actions locally
brew "act"
# Download with resuming and segmented downloading
brew "aria2"
# Core application library for C
brew "glib"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Freely available high-quality data compressor
brew "bzip2"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Low-level library for pixel manipulation
brew "pixman"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# GNU Emacs text editor
brew "emacs"
# OpenType text shaping engine
brew "harfbuzz"
# Multipurpose sniffer/interceptor/logger for switched LAN
brew "ettercap"
# GNU compiler collection
brew "gcc"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Libpcap-based NetFlow probe
brew "fprobe"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# SMART hard drive monitoring
brew "smartmontools"
# Graphical user interface for smartctl
brew "gsmartcontrol"
# GUI toolkit
brew "gtk+"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Improved top (interactive process viewer)
brew "htop"
# Spell checker and morphological analyzer
brew "hunspell"
# Portable Foreign Function Interface library
brew "libffi"
# Portable library for network traffic capture
brew "libpcap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# General purpose TCP-IP emulator
brew "libslirp"
# Library for support vector machines
brew "libsvm"
# Generic library support script
brew "libtool"
# Library for USB device access
brew "libusb"
# X.Org: X Pixmap (XPM) image file format library
brew "libxpm"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk@17"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# Image file loading library
brew "sdl_image"
# Strong open-source chess engine
brew "stockfish"
# Command-line Kanban board/task manager with support for Trello
brew "taskell"
# User interface to the TELNET protocol
brew "telnet"
# Extraction utility for .zip compressed archives
brew "unzip"
# Compress/expand executable files
brew "upx"
# Vi 'workalike' with many additional features
brew "vim"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Python bindings for wxWidgets
brew "wxpython"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Compression and file packaging/archive utility
brew "zip"
# Zlib replacement with optimizations for next generation systems
brew "zlib-ng"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Command-line Interface for the SmartThings APIs
brew "smartthingscommunity/smartthings/smartthings"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Android SDK component
cask "android-platform-tools"
# Audio utility
cask "background-music"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Block websites, games and applications
cask "cold-turkey-blocker"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Collaborative team software
cask "figma"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Git client focusing on productivity
cask "gitkraken"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Free and open-source media player
cask "iina"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Utility that shows the latest app updates
cask "latest"
# Multiplayer online battle arena game
cask "league-of-legends"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Remote desktop
cask "parsec"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Replacement for the volume, brightness and keyboard backlight HUDs
cask "slimhud"
# System monitor for the menu bar
cask "stats"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Run commands and display their output on the desktop
cask "ubersicht"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
# Compatibility layer to run Windows applications
cask "wine-devel"
# Porting tool, to make Windows programs/games into native apps
cask "wineskin"
# Video communication and virtual meeting platform
cask "zoom"
vscode "13xforever.language-x86-64-assembly"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "alexcvzz.vscode-sqlite"
vscode "asvetliakov.vscode-neovim"
vscode "coolchyni.beyond-debug"
vscode "cschlosser.doxdocgen"
vscode "dan-c-underwood.arm"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "geeebe.duplicate"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "hsnazar.hyper-term-theme"
vscode "jaakko.black"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "nimda.deepdark-material"
vscode "nur.just-black"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "qwtel.sqlite-viewer"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "serayuzgur.crates"
vscode "seyyedkhandon.firacode"
vscode "streetsidesoftware.code-spell-checker"
vscode "ttoowa.in-your-face-incredible"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "viktorqvarfordt.vscode-pitch-black-theme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vulfpeck.jetbrains-fleet-theme"
vscode "willumz.generic-pseudocode"
vscode "withfig.fig"
vscode "zhuangtongfa.material-theme"
